evidence/qwen38-27b-v1.0/gx10-01-xxj/20260902-20260903/raw/benchmarks-raw/local-llm-cross-platform-benchmark/qwen38-27b-v1.0/gx10-single/formal-32k/nvfp4/formal100/formal100.log.txt
nohup: ignoring input
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xe336c8e1fba0>, trust_remote_code=False, seed=20260831, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://<IP_REDACTED>:8000', host='<IP_REDACTED>', port=8000, endpoint='/v1/completions', header=None, max_concurrency=1, model='qwen38-27b-nvfp4-f5', input_len=32768, output_len=256, tokenizer='$HOME/xxj/models/original/qwen3.8-27b/nvfp4/9e3d73c76eddb75f795cc24ccfbc5affe41c66bd', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=1, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='$HOME/xxj/benchmarks/raw/local-llm-cross-platform-benchmark/qwen38-27b-v1.0/gx10-single/formal-32k/nvfp4/formal100', result_filename='formal100.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-b4dbfe70-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-31 20:17:03 [utils.py:90] Sampling input_len from [32768, 32768] and output_len from [256, 256]
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 1 requests...

  0%|          | 0/1 [00:00<?, ?it/s]
100%|██████████| 1/1 [00:55<00:00, 55.17s/it]
100%|██████████| 1/1 [00:55<00:00, 55.17s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:55<1:31:51, 55.67s/it]
  2%|▏         | 2/100 [01:50<1:30:00, 55.10s/it]
  3%|▎         | 3/100 [02:43<1:27:42, 54.25s/it]
  4%|▍         | 4/100 [03:37<1:26:21, 53.97s/it]
  5%|▌         | 5/100 [04:30<1:25:09, 53.79s/it]
  6%|▌         | 6/100 [05:24<1:24:06, 53.69s/it]
  7%|▋         | 7/100 [06:19<1:23:52, 54.12s/it]
  8%|▊         | 8/100 [07:12<1:22:40, 53.92s/it]
  9%|▉         | 9/100 [08:06<1:21:33, 53.78s/it]
 10%|█         | 10/100 [08:59<1:20:32, 53.70s/it]
 11%|█         | 11/100 [09:53<1:19:31, 53.61s/it]
 12%|█▏        | 12/100 [10:46<1:18:31, 53.54s/it]
 13%|█▎        | 13/100 [11:39<1:17:34, 53.50s/it]
 14%|█▍        | 14/100 [12:33<1:16:44, 53.54s/it]
 15%|█▌        | 15/100 [13:27<1:15:52, 53.55s/it]
 16%|█▌        | 16/100 [14:20<1:14:58, 53.55s/it]
 17%|█▋        | 17/100 [15:14<1:14:04, 53.54s/it]
 18%|█▊        | 18/100 [16:07<1:13:11, 53.56s/it]
 19%|█▉        | 19/100 [17:01<1:12:17, 53.54s/it]
 20%|██        | 20/100 [17:54<1:11:24, 53.55s/it]
 21%|██        | 21/100 [18:48<1:10:28, 53.52s/it]
 22%|██▏       | 22/100 [19:41<1:09:29, 53.46s/it]
 23%|██▎       | 23/100 [20:35<1:08:38, 53.49s/it]
 24%|██▍       | 24/100 [21:29<1:08:02, 53.72s/it]
 25%|██▌       | 25/100 [22:22<1:06:56, 53.55s/it]
 26%|██▌       | 26/100 [23:15<1:05:53, 53.43s/it]
 27%|██▋       | 27/100 [24:08<1:04:53, 53.34s/it]
 28%|██▊       | 28/100 [25:01<1:03:56, 53.29s/it]
 29%|██▉       | 29/100 [25:55<1:02:59, 53.23s/it]
 30%|███       | 30/100 [26:48<1:02:02, 53.18s/it]
 31%|███       | 31/100 [27:41<1:01:08, 53.16s/it]
 32%|███▏      | 32/100 [28:34<1:00:14, 53.15s/it]
 33%|███▎      | 33/100 [29:27<59:21, 53.15s/it]  
 34%|███▍      | 34/100 [30:20<58:28, 53.17s/it]
 35%|███▌      | 35/100 [31:13<57:33, 53.14s/it]
 36%|███▌      | 36/100 [32:06<56:41, 53.15s/it]
 37%|███▋      | 37/100 [33:00<55:47, 53.14s/it]
 38%|███▊      | 38/100 [33:53<54:53, 53.13s/it]
 39%|███▉      | 39/100 [34:46<54:01, 53.14s/it]
 40%|████      | 40/100 [35:39<53:08, 53.14s/it]
 41%|████      | 41/100 [36:32<52:15, 53.15s/it]
 42%|████▏     | 42/100 [37:25<51:22, 53.15s/it]
 43%|████▎     | 43/100 [38:18<50:27, 53.12s/it]
 44%|████▍     | 44/100 [39:12<49:35, 53.14s/it]
 45%|████▌     | 45/100 [40:05<48:41, 53.12s/it]
 46%|████▌     | 46/100 [40:58<47:47, 53.10s/it]
 47%|████▋     | 47/100 [41:51<46:54, 53.10s/it]
 48%|████▊     | 48/100 [42:44<46:01, 53.10s/it]
 49%|████▉     | 49/100 [43:37<45:08, 53.10s/it]
 50%|█████     | 50/100 [44:30<44:16, 53.12s/it]
 51%|█████     | 51/100 [45:23<43:22, 53.12s/it]
 52%|█████▏    | 52/100 [46:16<42:30, 53.13s/it]
 53%|█████▎    | 53/100 [47:10<41:37, 53.14s/it]
 54%|█████▍    | 54/100 [48:03<40:45, 53.15s/it]
 55%|█████▌    | 55/100 [48:56<39:51, 53.15s/it]
 56%|█████▌    | 56/100 [49:49<38:57, 53.13s/it]
 57%|█████▋    | 57/100 [50:42<38:04, 53.13s/it]
 58%|█████▊    | 58/100 [51:35<37:11, 53.14s/it]
 59%|█████▉    | 59/100 [52:28<36:18, 53.13s/it]
 60%|██████    | 60/100 [53:22<35:26, 53.16s/it]
 61%|██████    | 61/100 [54:15<34:32, 53.14s/it]
 62%|██████▏   | 62/100 [55:08<33:39, 53.15s/it]
 63%|██████▎   | 63/100 [56:01<32:46, 53.15s/it]
 64%|██████▍   | 64/100 [56:54<31:52, 53.14s/it]
 65%|██████▌   | 65/100 [57:47<30:59, 53.13s/it]
 66%|██████▌   | 66/100 [58:40<30:06, 53.13s/it]
 67%|██████▋   | 67/100 [59:33<29:12, 53.10s/it]
 68%|██████▊   | 68/100 [1:00:27<28:19, 53.12s/it]
 69%|██████▉   | 69/100 [1:01:20<27:26, 53.12s/it]
 70%|███████   | 70/100 [1:02:13<26:34, 53.14s/it]
 71%|███████   | 71/100 [1:03:06<25:41, 53.14s/it]
 72%|███████▏  | 72/100 [1:03:59<24:47, 53.13s/it]
 73%|███████▎  | 73/100 [1:04:52<23:54, 53.13s/it]
 74%|███████▍  | 74/100 [1:05:45<23:01, 53.14s/it]
 75%|███████▌  | 75/100 [1:06:39<22:08, 53.13s/it]
 76%|███████▌  | 76/100 [1:07:32<21:15, 53.14s/it]
 77%|███████▋  | 77/100 [1:08:25<20:21, 53.13s/it]
 78%|███████▊  | 78/100 [1:09:18<19:29, 53.15s/it]
 79%|███████▉  | 79/100 [1:10:11<18:36, 53.15s/it]
 80%|████████  | 80/100 [1:11:04<17:42, 53.13s/it]
 81%|████████  | 81/100 [1:11:57<16:49, 53.14s/it]
 82%|████████▏ | 82/100 [1:12:50<15:56, 53.13s/it]
 83%|████████▎ | 83/100 [1:13:44<15:03, 53.13s/it]
 84%|████████▍ | 84/100 [1:14:37<14:10, 53.15s/it]
 85%|████████▌ | 85/100 [1:15:30<13:17, 53.15s/it]
 86%|████████▌ | 86/100 [1:16:23<12:24, 53.16s/it]
 87%|████████▋ | 87/100 [1:17:16<11:30, 53.15s/it]
 88%|████████▊ | 88/100 [1:18:09<10:37, 53.13s/it]
 89%|████████▉ | 89/100 [1:19:02<09:44, 53.13s/it]
 90%|█████████ | 90/100 [1:19:56<08:51, 53.13s/it]
 91%|█████████ | 91/100 [1:20:49<07:58, 53.14s/it]
 92%|█████████▏| 92/100 [1:21:42<07:05, 53.15s/it]
 93%|█████████▎| 93/100 [1:22:35<06:11, 53.13s/it]
 94%|█████████▍| 94/100 [1:23:28<05:18, 53.14s/it]
 95%|█████████▌| 95/100 [1:24:21<04:25, 53.14s/it]
 96%|█████████▌| 96/100 [1:25:14<03:32, 53.14s/it]
 97%|█████████▋| 97/100 [1:26:08<02:39, 53.14s/it]
 98%|█████████▊| 98/100 [1:27:01<01:46, 53.13s/it]
 99%|█████████▉| 99/100 [1:27:54<00:53, 53.15s/it]
100%|██████████| 100/100 [1:28:47<00:00, 53.15s/it]
100%|██████████| 100/100 [1:28:47<00:00, 53.28s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  5327.55   
Total input tokens:                      3276800   
Total generated tokens:                  25600     
Request throughput (req/s):              0.02      
Output token throughput (tok/s):         4.81      
Peak output token throughput (tok/s):    10.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          619.87    
---------------Time to First Token----------------
Mean TTFT (ms):                          25194.25  
Median TTFT (ms):                        25146.42  
P50 TTFT (ms):                           25146.42  
P90 TTFT (ms):                           25385.88  
P95 TTFT (ms):                           25457.47  
P99 TTFT (ms):                           26122.46  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          110.12    
Median TPOT (ms):                        109.85    
P50 TPOT (ms):                           109.85    
P90 TPOT (ms):                           111.20    
P95 TPOT (ms):                           111.28    
P99 TPOT (ms):                           113.27    
---------------Inter-token Latency----------------
Mean ITL (ms):                           110.12    
Median ITL (ms):                         110.54    
P50 ITL (ms):                            110.54    
P90 ITL (ms):                            113.56    
P95 ITL (ms):                            114.53    
P99 ITL (ms):                            116.79    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          53275.25  
Median E2EL (ms):                        53150.72  
P50 E2EL (ms):                           53150.72  
P90 E2EL (ms):                           53541.46  
P95 E2EL (ms):                           53598.16  
P99 E2EL (ms):                           55004.19  
==================================================